README.org
#+TITLE: grass-emacs

#+PROPERTY: header-args               :results silent
#+PROPERTY: header-args:emacs-lisp    :tangle init.el

本仓库是我的个人 =Emacs= 配置，主打一个满足个人日常使用。如果里面的一些代码对你有帮助，欢迎拿走。

* 目录                                                                  :TOC:
- [[#header][Header]]
- [[#如何使用][如何使用]]
  - [[#nixos-用户][NixOS 用户]]
  - [[#nix-darwin-用户][Nix-Darwin 用户]]
  - [[#非-nixos-用户][非 NixOS 用户]]
- [[#全局配置][全局配置]]
  - [[#emacs-版本判断][Emacs 版本判断]]
  - [[#定义常量][定义常量]]
  - [[#常用工具函数][常用工具函数]]
  - [[#定义常用目录][定义常用目录]]
  - [[#修改默认配置][修改默认配置]]
  - [[#性能优化][性能优化]]
  - [[#定义用户级别的键位映射图][定义用户级别的键位映射图]]
- [[#包管理工具及相关依赖][包管理工具及相关依赖]]
  - [[#straightel][straight.el]]
  - [[#leafel][leaf.el]]
  - [[#systempackages][systemPackages]]
  - [[#shell-path][Shell Path]]
- [[#内置包的配置][内置包的配置]]
- [[#功能增强][功能增强]]
  - [[#meow---模态编辑][Meow - 模态编辑]]
  - [[#smart-input-source用于在模式编辑中自动切换输入法][smart-input-source用于在模式编辑中，自动切换输入法。]]
  - [[#ace-window][ace-window]]
  - [[#mwim][mwim]]
  - [[#doom-modeline][doom-modeline]]
  - [[#good-scroll][good-scroll]]
  - [[#which-key][which-key]]
  - [[#avy][avy]]
  - [[#marginalia][marginalia]]
  - [[#consult][consult]]
  - [[#vertico][vertico]]
  - [[#embark][embark]]
  - [[#orderless][orderless]]
  - [[#rainbow-delimiters][rainbow-delimiters]]
  - [[#transient][transient]]
- [[#应用程序][应用程序]]
  - [[#mu4e---邮件][mu4e - 邮件]]
  - [[#rss][RSS]]
  - [[#pocket][Pocket]]
  - [[#浏览器][浏览器]]
- [[#补全][补全]]
- [[#lsp-bridge][LSP-Bridge]]
  - [[#gui][GUI]]
  - [[#tui-patch-ace-terminal][TUI Patch (ace-terminal)]]
- [[#项目工程][项目工程]]
  - [[#project][Project]]
  - [[#projectile][Projectile]]
  - [[#magit][Magit]]
- [[#org][Org]]
  - [[#org-base][Org base]]
  - [[#org-agenda][Org Agenda]]
  - [[#org-habit][Org Habit]]
  - [[#org-pomodoro-番茄钟][Org Pomodoro 番茄钟]]
  - [[#org-roam][Org-roam]]
  - [[#org-mordern][Org-Mordern]]
  - [[#ox-hugo][Ox-hugo]]
  - [[#org-caldav][Org Caldav]]
  - [[#org-anki][Org Anki]]
  - [[#toc-org-自动生成目录][Toc-Org 自动生成目录]]
  - [[#cal-x-农历][cal-x 农历]]
- [[#编程语言][编程语言]]
  - [[#通用配置][通用配置]]
  - [[#nix][Nix]]
  - [[#sh-script][Sh Script]]
  - [[#php][PHP]]
  - [[#python][Python]]
  - [[#r][R]]
  - [[#haskell][Haskell]]
  - [[#web][Web]]
  - [[#vue][Vue]]
  - [[#markdown][Markdown]]
  - [[#yaml][YAML]]
  - [[#dotenv][Dotenv]]
  - [[#plantuml][PlantUML]]
  - [[#mermaid][Mermaid]]
  - [[#just-file][Just File]]
  - [[#docker][Docker]]
  - [[#todo-keyword][TODO-keyword]]
  - [[#ledger][Ledger]]
- [[#style][Style]]
- [[#杂项][杂项]]
  - [[#undoredo][Undo/Redo]]
  - [[#小功能][小功能]]
  - [[#dashboard][Dashboard]]
  - [[#auto-save][Auto save]]
- [[#加载自定义文件][加载自定义文件]]
- [[#footer][Footer]]

* Header
#+begin_src emacs-lisp
;;; init.el --- Load the full configuration -*- lexical-binding: t -*-
;;; Commentary:

;; This file bootstraps the full configuration

;;; Code:
#+end_src

* 如何使用
** NixOS 用户

*** 使用 Flakes

#+name: flake.nix
#+begin_src nix
  # 其它inputs
  {
    inputs.grass-emacs.url = "github:running-grass/grass-emacs";

    # 在主机配置中导入模块
    nixosConfigurations.galaxy =
      lib.nixosSystem { modules = [ inputs.grass-emacs.nixosModules.default ]; };
  }
#+end_src

可以直接在命令行使用 =Emacs= 启动。

** Nix-Darwin 用户

目前还不太好用，堪堪可以使用

#+name: flake.nix
#+begin_src nix
  # 其它inputs
  {
    inputs.grass-emacs.url = "github:running-grass/grass-emacs";

    # 在主机配置中导入模块
    darwinConfigurations.galaxy = inputs.nix-darwin.lib.darwinSystem {
      modules = [ inputs.grass-emacs.nixosModules.default ];
    };
  }
#+end_src

** 非 NixOS 用户

*** 前置条件
1. =Emacs= 版本大于 =29=
2. 命令行依赖
   1. git
   2. wakatime-cli
   3. mu
   4. python3
   5. multimarkdown
3. 其它依赖
   1. 确保 =~/.emacs= ， =~/.emacs.d= 和 =~/.config/emacs= 目录不存在，如果存在需要重命名备份
*** 安装

执行下列代码克隆仓库

#+begin_src bash
  git clone git@github.com:running-grass/grass-emacs.git ~/.config/emacs
#+end_src

修改配置以后就可以使用 =SPC r= 来重新加载配置了。
* 全局配置
** Emacs 版本判断
#+begin_src emacs-lisp
  (when (version< emacs-version "29")
    (error "必须要使用 Emacs 29 以上的版本"))
#+end_src

** 定义常量
#+begin_src emacs-lisp
  ;; 判断是否是 MacOS 系统
  (defconst *is-mac* (eq system-type 'darwin) "是否是 MacOS 操作系统")
  ;; 判断是否是 Linux 系统
  (defconst *is-linux* (eq system-type 'gnu/linux) "是否是 Linux 操作系统")
  ;; 判断是否是 Windows 系统
  (defconst *is-win* (eq system-type 'windows-nt) "是否是 Windows 操作系统")

  ;; 是否是 GUI
  (defconst *is-gui* (display-graphic-p) "是否是GUI")
  ;; 是否是 TUI
  (defconst *is-tui* (not *is-gui*) "是否是TUI")

  ;; 是否是 nixos/darwin 模块 使用
  (defconst *is-nix-module* (equal (getenv "GRASS_EMACS_ENV") "nix-module") "是否是Nix模块")
  ;; 是否是nixos
  (defconst *is-nixos* (and *is-linux* *is-nix-module*) "是否是 NixOS 操作系统")
#+end_src

** 常用工具函数
#+begin_src emacs-lisp
  ;; 计算中国农历的年份，用于org中
  (defun grass-emacs/calc-chinese-year (year)
    (let* ((cycle (/ (+ year 2637) 60.0))
           (year  (- (+ year 2637) (* 60 (truncate cycle)))))
      (list  (+ 1 (floor cycle)) year))

    )

  ;; 从 Bitwarden 中读取密码
  (defun grass-emacs/get-bitwarden-password (name)
    "根据name从rbw（Bitwarden 非官方 cli 客户端） 中读取密码"
    (let (
          (out (shell-command-to-string (concat "echo -n `rbw get " name "`")))
          )
      (if (string-prefix-p "rbw get: couldn't find entry for" out) (error "没找到对应的密码") out)
      ))

#+end_src
** 定义常用目录

这里定义了四个 =Emacs= 使用过程中的目录， 配置、数据、状态、缓存

配置： 存放各种配置文件， 例如 =init.el= 和 =early-init.el= 等，以及用户自定义配置文件，用于存储敏感信息，可以在多台机器直接复用
数据： 存放数据型的文件，例如 =sqllite= 数据库的存储，或者 =BBDB= 数据库文件等，同样可以在多台机器直接共享。 和配置的区别在于，一个是声明式的，一个是动态增加的数据
状态： 在多次启动运行之间共享的状态，例如 最近打开的文件，搜索历史等， 不可以跨机器和跨用户使用。
缓存： 使用过程中的缓存文件，可以被安全的删除，必须可以被重建。

#+begin_src emacs-lisp
  (require 'xdg)

  (defun expand-emacs-config (filename)
    "expand emacs config files"
    (expand-file-name filename
                      (or (getenv "EMACS_DEBUG_DIR")
                          (expand-file-name "emacs" (xdg-config-home))

                          )))

  (defun expand-emacs-data (filename)
    "expand emacs data files"
    (expand-file-name filename
                      (expand-file-name "emacs" (xdg-data-home))
                      ))

  (defun expand-emacs-state (filename)
    "expand emacs state files"
    (expand-file-name filename
                      (expand-file-name "emacs" (xdg-state-home))
                      ))

  (defun expand-emacs-cache (filename)
    "expand emacs cache files"
    (expand-file-name filename
                      (expand-file-name "emacs" (xdg-cache-home))
                      ))

  ;; 给 eln-cache 目录换个地方
  (when (boundp 'native-comp-eln-load-path)
    (startup-redirect-eln-cache (expand-emacs-cache "eln-cache")))

  ;; 定义自定义文件
  (defconst *custom-file* (expand-emacs-data "custom.el") "一些个性化的定义存放之地")

  ;; 插件默认使用这个目录，如果需要的话，再调整到其它相关目录
  (setq user-emacs-directory (expand-emacs-state ""))
  ;; 更改到缓存目录
  (setq package-user-dir (expand-emacs-cache "elpa"))
#+end_src

** 修改默认配置
#+begin_src emacs-lisp
  ;; 关闭原生编译警告
  (setq native-comp-async-report-warnings-errors nil)
  ;; 关闭启动画面
  (setq inhibit-startup-screen t)
  ;; 禁用对话框
  (setq use-dialog-box nil)
  ;; 禁用文件对话框
  (setq use-file-dialog nil)

  ;; 允许像素级别调整窗口和窗体大小
  (setq-default
   window-resize-pixelwise t
   frame-resize-pixelwise t)

  ;; 关闭工具栏
  (when (fboundp 'tool-bar-mode)
    (tool-bar-mode -1))
  ;; 关闭文件滑动控件
  (when (fboundp 'set-scroll-bar-mode)
    (set-scroll-bar-mode nil))
  ;; 关闭菜单栏
  (menu-bar-mode -1)

  ;; 隐藏内部边框
  (let ((no-border '(internal-border-width . 0)))
    (add-to-list 'default-frame-alist no-border)
    (add-to-list 'initial-frame-alist no-border))

  ;; 开启像素级滚动
  (when (fboundp 'pixel-scroll-precision-mode)
    (pixel-scroll-precision-mode))


  ;; 关闭emacs自带的退出确认
  (setq confirm-kill-emacs #'yes-or-no-p)

  ;; 自动补全括号(关闭，有时候很烦人))
  (electric-pair-mode -1)

  ;; 编程模式下，光标在括号上时高亮另一个括号
  (add-hook 'prog-mode-hook #'show-paren-mode)
  ;; 在 Mode line 上显示列号
  (column-number-mode 1)

  ;; 选中文本后输入文本会替换文本（更符合我们习惯了的其它编辑器的逻辑）
  (delete-selection-mode t)

  ;; 关闭文件自动备份
  (setq make-backup-files nil)
  ;; 编程模式下，可以折叠代码块
  (add-hook 'prog-mode-hook #'hs-minor-mode)

  ;; 如果是nixos关闭内置的包管理工具
  (when *is-nix-module*
    (setq package-enable-at-startup nil))

  ;; 设置等宽字体
  (set-face-attribute 'default nil :family "Sarasa Term Slab SC" :height 140)
  ;; 设置后备字体
  (set-fontset-font t nil "Sarasa Term SC" nil 'prepend)
  (set-fontset-font t nil "Iosevka" nil 'prepend)
  (set-fontset-font t nil "Source Han Sans HW" nil 'append)
  (set-fontset-font t nil "Unifont" nil 'append)
  (set-fontset-font t nil "Symbols Nerd Font" nil 'append)

  ;; 设置自动折行
  (setq truncate-lines nil)

  ;; 默认查找目录为home目录
  (setq command-line-default-directory "~")
  (setq nerd-icons-font-names '("SymbolsNerdFontMono-Regular.ttf")) ;

  ;; 设置2个空格
  (setq-default indent-tabs-mode nil)
  (setq-default tab-width 2)
  (setq-default default-tab-width 2)
  (setq-default js-indent-level 2)

  ;; 使用短的 y-or-n
  (setopt use-short-answers t)

  ;; 禁用外部程序的粘贴板，避免扰乱emacs 内部的 kill-ring
  (setq select-enable-clipboard nil)

  ;; 为外部剪切板增加绑定
  (keymap-global-set "C-S-y" 'meow-clipboard-yank)
  (keymap-global-set "C-S-s" 'meow-clipboard-save)
  (keymap-global-unset  "C-h C-f")

  (setq bookmark-default-file (expand-emacs-data "bookmarks"))
  (setq auto-save-list-file-prefix (expand-emacs-state "auto-save-list/.saves-"))
#+End_src

** 性能优化
#+begin_src emacs-lisp
  ;; 调大 gc 的阈值
  (let ((normal-gc-cons-threshold (* 20 1024 1024))
        (init-gc-cons-threshold (* 128 1024 1024)))
    (setq gc-cons-threshold init-gc-cons-threshold)
    (add-hook 'emacs-startup-hook
              (lambda () (setq gc-cons-threshold normal-gc-cons-threshold))))

  ;; 调大子进程的输出读取缓冲
  (setq read-process-output-max (* 4 1024 1024))
  ;; 关闭对子进程读取输出时的延迟缓冲
  (setq process-adaptive-read-buffering nil)
#+end_src

