README.org
** 定义用户级别的键位映射图

定义了几个键位映射图，用于作为一些常用命令的分组。

会被绑定到 =meow= 的 =leader= 键位图中

#+begin_src emacs-lisp
  (defvar application-keymap (make-sparse-keymap) "applications")
  (defalias 'application-keymap application-keymap)

  (defvar project-keymap (make-sparse-keymap) "project commands")
  (defalias 'project-keymap project-keymap)

  (defvar buffer-keymap (make-sparse-keymap) "buffer operations")
  (defalias 'buffer-keymap buffer-keymap)

  (defvar file-keymap (make-sparse-keymap) "file operations")
  (defalias 'file-keymap file-keymap)

  (defvar org-keymap (make-sparse-keymap) "所有gtd相关的全局操作都在这里")
  (defalias 'org-keymap org-keymap)

  (defvar-keymap grass/jump-map
    :doc "My jump keymap"
    )
  (keymap-set global-map "C-c j" grass/jump-map)

  (defvar toggle-keymap (make-sparse-keymap) "一些开关按键")
  (defalias 'toggle-keymap toggle-keymap)
#+end_src

* 包管理工具及相关依赖
** straight.el
#+begin_src emacs-lisp
  (defvar bootstrap-version)
  (setq straight-base-dir (expand-emacs-state ""))
  (let ((bootstrap-file
         (expand-file-name
          "straight/repos/straight.el/bootstrap.el"
          (or (bound-and-true-p straight-base-dir)
              user-emacs-directory)))
        (bootstrap-version 7))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
          (url-retrieve-synchronously
           "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
           'silent 'inhibit-cookies)
        (goto-char (point-max))
        (eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))
#+end_src

** leaf.el
#+begin_src emacs-lisp
  (straight-use-package 'leaf)
  (straight-use-package 'leaf-keywords)
  (leaf leaf-keywords
    :custom
    (leaf-expand-ensure-system-package . t)
    :config
    (leaf-keywords-init)
    )
#+end_src

** systemPackages
#+begin_src emacs-lisp
  (leaf system-packages
    :straight '(system-packages
                :type git :host github :repo "running-grass/system-packages")
    :custom
    (system-packages-use-sudo . nil)
    (system-packages-noconfirm . t)
    :config
    (system-packages-ensure "git")
    )
#+end_src

** Shell Path
#+begin_src emacs-lisp
  (leaf exec-path-from-shell
    :straight t
    :config
    (exec-path-from-shell-initialize))
#+end_src
* 内置包的配置

#+begin_src emacs-lisp
  (leaf url
    :custom
    `(url-configuration-directory . ,(expand-emacs-state "url"))
    )
  ;; 保存了上一次打开文件时的光标位置
  (leaf saveplace
    :global-minor-mode save-place-mode
    :custom
    `(save-place-file . ,(expand-emacs-state "places"))
    )

  ;; 命令记录
  (leaf savehist
    :global-minor-mode t
    :custom
    (savehist-autosave-interval . 60)
    `(savehist-file . ,(expand-emacs-state "history"))
    )

  (leaf dabbrev
    ;; Swap M-/ and C-M-/
    :bind (("M-/" . dabbrev-completion)
           ("C-M-/" . dabbrev-expand))
    ;; Other useful Dabbrev configurations.
    :custom
    (dabbrev-ignored-buffer-regexps . '("\\.\\(?:pdf\\|jpe?g\\|png\\)\\'")))


  ;; 配置 tramp -- 远程编辑
  (leaf tramp
    :custom
    (tramp-default-method . "ssh")
    `(tramp-persistency-file-name . ,(expand-emacs-state "tramp")))

  ;; 文件被外部程序修改后，重新载入buffer
  (leaf autorevert
    :global-minor-mode global-auto-revert-mode
    )

  ;; 最近打开的文件
  (leaf recentf
    :global-minor-mode t
    :custom
    `(recentf-save-file . ,(expand-emacs-state "recentf"))
    (recentf-max-saved-items . 2000)
    (recentf-max-menu-items . 150)
    )

#+end_src

* 功能增强

** Meow - 模态编辑

可以说这个模态编辑包是整个配置中我最喜欢的。 它可以最大限度的使用 =Emacs= 原生键位。而不需要每安装一个新的包，就去做一些适配和兼容（我说的就是 =evil= ）
#+begin_src emacs-lisp
  (defun reload-config ()
    "重新加载配置"
    (interactive)
    (progn
      (org-babel-tangle-file (expand-emacs-config  "README.org"))
      (load-file (expand-emacs-config "init.el"))
      )
    )

  (defun meow-setup ()
    (setq meow-cheatsheet-layout meow-cheatsheet-layout-qwerty)

    (meow-motion-overwrite-define-key
     ;; '("j" . meow-next)
     ;; '("k" . meow-prev)
     '("<escape>" . ignore))
    (meow-leader-define-key
     ;; SPC j/k will run the original command in MOTION state.
     '("J" . "H-j")
     '("K" . "H-k")
     ;; Use SPC (0-9) for digit arguments.
     '("1" . meow-digit-argument)
     '("2" . meow-digit-argument)
     '("3" . meow-digit-argument)
     '("4" . meow-digit-argument)
     '("5" . meow-digit-argument)
     '("6" . meow-digit-argument)
     '("7" . meow-digit-argument)
     '("8" . meow-digit-argument)
     '("9" . meow-digit-argument)
     '("0" . meow-digit-argument)
     '("/" . meow-keypad-describe-key)

     '("?" . meow-cheatsheet)

     '("<SPC>" . consult-mode-command)

     '("r" . reload-config)
     )
    (meow-normal-define-key
     '("0" . meow-expand-0)
     '("9" . meow-expand-9)
     '("8" . meow-expand-8)
     '("7" . meow-expand-7)
     '("6" . meow-expand-6)
     '("5" . meow-expand-5)
     '("4" . meow-expand-4)
     '("3" . meow-expand-3)
     '("2" . meow-expand-2)
     '("1" . meow-expand-1)
     '("-" . negative-argument)
     '(";" . meow-reverse)
     '("," . meow-inner-of-thing)
     '("." . meow-bounds-of-thing)
     '("[" . meow-beginning-of-thing)
     '("]" . meow-end-of-thing)
     '("a" . meow-append)
     '("A" . meow-open-below)
     '("b" . meow-back-word)
     '("B" . meow-back-symbol)
     '("c" . meow-change)
     '("d" . meow-delete)
     '("D" . meow-backward-delete)
     '("e" . meow-next-word)
     '("E" . meow-next-symbol)
     '("f" . meow-find)
     '("g" . meow-cancel-selection)
     '("G" . meow-grab)
     '("h" . meow-left)
     '("H" . meow-left-expand)
     '("i" . meow-insert)
     '("I" . meow-open-above)
     '("j" . meow-next)
     '("J" . meow-next-expand)
     '("k" . meow-prev)
     '("K" . meow-prev-expand)
     '("l" . meow-right)
     '("L" . meow-right-expand)
     '("m" . meow-join)
     '("n" . meow-search)
     '("o" . meow-block)
     '("O" . meow-to-block)
     '("p" . meow-yank)
     '("P" . consult-yank-from-kill-ring)
     '("q" . meow-quit)
     '("Q" . meow-goto-line)
     '("r" . meow-replace)
     '("R" . meow-swap-grab)
     '("s" . meow-kill)
     '("t" . meow-till)
     '("u" . meow-undo)
     '("U" . meow-undo-in-selection)
     '("v" . meow-visit)
     '("w" . meow-mark-word)
     '("W" . meow-mark-symbol)
     '("x" . meow-line)
     '("X" . meow-goto-line)
     '("y" . meow-save)
     '("Y" . meow-sync-grab)
     '("z" . meow-pop-selection)
     '("'" . repeat)
     '("<escape>" . ignore))
    )
  (leaf meow
    :straight t
    :require t
    :init
    (defvar meow-leaving-insert-mode-hook nil
      "Hook to run when leaving meow insert mode.")
    (defvar meow-entering-insert-mode-hook nil
      "Hook to run when entering meow insert mode.")


    :hook
    (meow-insert-mode-hook . (lambda ()
                             (if meow-insert-mode
                                 (run-hooks 'meow-entering-insert-mode-hook)
                               (run-hooks 'meow-leaving-insert-mode-hook))))
    (meow-leaving-insert-mode-hook . sis-set-english)

    :config
    (meow-setup)
    (meow-global-mode 1)
    (add-to-list 'meow-mode-state-list '(minibuffer-mode . insert))
    )
#+end_src

