README.org
** smart-input-source用于在模式编辑中，自动切换输入法。
包括从插入模式退出的时候，以及输入按键序列的时候，都会自动切换输入法到英文，再次进入插入模式的时候，又会自动恢复之前的输入法
#+begin_src emacs-lisp
  (leaf sis
    :straight t
    :when *is-linux*
    :hook
    (sis-context-hooks . meow-entering-insert-mode-hook)
    ;; enable the /context/ and /inline region/ mode for specific buffers
    ;; (((text-mode prog-mode) . sis-context-mode)
    ;;  ((text-mode prog-mode) . sis-inline-mode))
    :config
    ;; For MacOS
    (sis-ism-lazyman-config
     ;; English input source may be: "ABC", "US" or another one.
     ;; "com.apple.keylayout.ABC"
     "1"

     ;; Other language input source: "rime", "sogou" or another one.
     ;; "im.rime.inputmethod.Squirrel.Rime"
     "2"

     'fcitx5
     )

    ;; enable the /cursor color/ mode
    (sis-global-cursor-color-mode t)
    ;; enable the /respect/ mode
    (sis-global-respect-mode -1)
    ;; enable the /context/ mode for all buffers
    (sis-global-context-mode 1)
    ;; enable the /inline english/ mode for all buffers
    ;; (sis-global-inline-mode t)

    ;; org title 处切换 Rime，telega 聊天时切换 Rime。
    ;; 使用模式编辑 meow，需要额外加 meow-insert-mode 条件。
    (add-to-list 'sis-context-detectors
                 (lambda (&rest _)
                   (when (and meow-insert-mode
                              (or (derived-mode-p 'org-mode
                                                  'telega-chat-mode
                                                  )))
                     'other)))

    (defun +meow-focus-change-function ()
      (if (frame-focus-state)
          (sis-set-english)
        (meow-insert-exit)))

    (add-function :after after-focus-change-function '+meow-focus-change-function)
    )
#+end_src
** ace-window

这又是一个 abo-abo（Oleh Krehel）的项目。我们用 Emacs 多窗口时，window 超过 3 个后就很难使用 C-x o 进行切换了。ace-window 对 C-x o 重新绑定，使用时可以为每个 window 编个号，用编号进行跳转。


#+begin_src emacs-lisp
  (leaf ace-window
    :straight t
    :bind (("C-x o" . ace-window)))
#+end_src


** mwim

还记得我们提到 C-a 对应了 move-beginning-of-line，M-m 对应了 back-to-indentation。当代码有缩进时，前者会把光标移动到行首（到空格之前），后者会移动到代码文字的开头（到空格之后）。那么实际中这两个按法差别较大，且不易区分，使用起来不方便。mwim 就将二者合并，覆盖 C-a 为 mwim-beginning-of-code-or-line，这样按一次 C-a 时移动到代码文字开头，再按一次则是移动到整行的行首，如此反复。

同时，更有意义的是，它还可以覆盖 C-e move-end-of-line 为 mwim-end-of-code-or-line，当本行代码结尾有注释时，第一次按 C-e 将光标移动到代码尾部、注释之前。再按一次则是移动到整行的行尾。 这就大大提高了写代码的效率。

#+begin_src emacs-lisp
  (leaf mwim
    :straight t
    :bind
    ("C-a" . mwim-beginning-of-code-or-line)
    ("C-e" . mwim-end-of-code-or-line))
#+end_src


** doom-modeline

可以进行丰富的定制化

#+begin_src emacs-lisp
  (leaf doom-modeline
    :straight t
    :global-minor-mode t
    :custom
    (doom-modeline-modal-icon . t)
    )
#+end_src

** good-scroll

在现代图形界面操作系统中，光标在上下移动、翻页的时候 Emacs 会直接刷新界面，滚动时也是按行滚动，比较粗糙。good-scroll 提供了平滑滚动，并且支持变速滚动，更加顺手。


#+begin_src emacs-lisp
  (leaf good-scroll
    :straight t
    :global-minor-mode t
    :when *is-gui*          ; 在图形化界面时才使用这个插件
    )
#+end_src

** which-key

这是一个实用小工具，专门针对 Emacs 快捷键多而杂的问题，安装后，当按下部分快捷键前缀时，它会通过 minibuffer 提示你都有哪些可以按的快捷键及其命令名。例如启动了 hs-minor-mode 后，我们正常可以通过 C-c @ C-h 折叠代码块、用 C-c @ C-s 来展开代码块。但这个快捷键很长，时常记不住，那么有了 which-key 后我们可以先按下 C-c @ ，此时 which-key 就会提示我们接下来可以按的键：

#+begin_src emacs-lisp
  (leaf which-key
    :straight t
    :global-minor-mode t
    )
#+end_src


** avy

[[https://pavinberg.github.io/emacs-book/zh/enhancement/#avy][使用方法]]

#+begin_src emacs-lisp
  (leaf avy
    :straight t
    :bind
    ("C-c j j" . avy-goto-char-timer)
    ("C-c j l" . avy-goto-line)
    )
#+end_src

** marginalia

可以为 Emacs minibuffer 中的选项添加注解

#+begin_src emacs-lisp
  ;; Enable rich annotations using the Marginalia package
  (leaf marginalia
    :straight t
    :global-minor-mode t
    ;; Bind `marginalia-cycle' locally in the minibuffer.  To make the binding
    ;; available in the *Completions* buffer, add it to the
    ;; `completion-list-mode-map'.
    :bind
    (:minibuffer-local-map
     ("M-A" . marginalia-cycle))
    )
#+end_src

** consult

#+begin_src emacs-lisp
  (defun delete-current-file ()
    "Delete the file associated with the current buffer. Delete the current buffer too. If no file is associated, just close buffer without prompt for save."
    (interactive)
    (let ((currentFile (buffer-file-name)))
      (when (yes-or-no-p (concat "Delete file?: " currentFile))
        (kill-buffer (current-buffer))
        (when currentFile (delete-file currentFile)))))

  ;; Example configuration for Consult
  (leaf consult
    :straight t
    :ensure-system-package (rg . ripgrep)
    :bind
    ("C-c b b" . consult-buffer)
    ("C-c p s" . consult-ripgrep)
    ("C-c f f" . find-file)
    ("C-c f d" . delete-current-file)
    ("C-c f e" . consult-recent-file)
    ("C-c j g" . consult-goto-line)            ;; orig. goto-line
    ("C-c j m" . consult-imenu)
    ("C-c j s" . consult-line)                ;; orig. previous-matching-history-element

    ;; Enable automatic preview at point in the *Completions* buffer. This is
    ;; relevant when you use the default completion UI.
    :hook
    (completion-list-mode-hook . consult-preview-at-point-mode)

    ;; The :init configuration is always executed (Not lazy)
    :custom
    ;; Optionally configure the register formatting. This improves the register
    ;; preview for `consult-register', `consult-register-load',
    ;; `consult-register-store' and the Emacs built-ins.
    (register-preview-delay . 0.5)
    (register-preview-function . #'consult-register-format)
    ;; Use Consult to select xref locations with preview
    (xref-show-xrefs-function . #'consult-xref)
    (xref-show-definitions-function . #'consult-xref)
    ;; Optionally configure the narrowing key.
    ;; Both < and C-+ work reasonably well.
    (consult-narrow-key . "<") ;; "C-+"

    ;; Optionally tweak the register preview window.
    ;; This adds thin lines, sorting and hides the mode line of the window.
    :init
    (advice-add #'register-preview :override #'consult-register-window)

    ;; Configure other variables and modes in the :config section,
    ;; after lazily loading the package.
    :config

    ;; Optionally configure preview. The default value
    ;; is 'any, such that any key triggers the preview.
    ;; (setq consult-preview-key 'any)
    ;; (setq consult-preview-key "M-.")
    ;; (setq consult-preview-key '("S-<down>" "S-<up>"))
    ;; For some commands and buffer sources it is useful to configure the
    ;; :preview-key on a per-command basis using the `consult-customize' macro.
    (consult-customize
     consult-theme :preview-key '(:debounce 0.2 any)
     consult-ripgrep consult-git-grep consult-grep
     consult-bookmark consult-recent-file
     ;; consult-xref
     consult--source-bookmark consult--source-file-register
     consult--source-recent-file consult--source-project-recent-file
     ;; :preview-key "M-."
     :preview-key '(:debounce 0.4 any))


    ;; Optionally make narrowing help available in the minibuffer.
    ;; You may want to use `embark-prefix-help-command' or which-key instead.
    ;; (define-key consult-narrow-map (vconcat consult-narrow-key "?") #'consult-narrow-help)

    ;; By default `consult-project-function' uses `project-root' from project.el.
    ;; Optionally configure a different project root function.
      ;;;; 1. project.el (the default)
    ;; (setq consult-project-function #'consult--default-project-function)
      ;;;; 2. vc.el (vc-root-dir)
    ;; (setq consult-project-function (lambda (_) (vc-root-dir)))
      ;;;; 3. locate-dominating-file
    ;; (setq consult-project-function (lambda (_) (locate-dominating-file "." ".git")))
    ;; 4. projectile.el (projectile-project-root)
    (autoload 'projectile-project-root "projectile")
    (setq consult-project-function (lambda (_) (projectile-project-root)))
      ;;;; 5. No project support
    ;; (setq consult-project-function nil)
    )
#+end_src

** vertico

#+begin_src emacs-lisp
  (leaf vertico
    :straight t
    :global-minor-mode t
    :custom
    ;; Show more candidates
    (vertico-count . 20)

    ;; Grow and shrink the Vertico minibuffer
    (vertico-resize . t)

    ;; Optionally enable cycling for `vertico-next' and `vertico-previous'.
    (vertico-cycle . t)
    )
#+end_src

