init.el
  (sis-context-hooks . meow-entering-insert-mode-hook)
  ;; enable the /context/ and /inline region/ mode for specific buffers
  ;; (((text-mode prog-mode) . sis-context-mode)
  ;;  ((text-mode prog-mode) . sis-inline-mode))
  :config
  ;; For MacOS
  (sis-ism-lazyman-config
   ;; English input source may be: "ABC", "US" or another one.
   ;; "com.apple.keylayout.ABC"
   "1"

   ;; Other language input source: "rime", "sogou" or another one.
   ;; "im.rime.inputmethod.Squirrel.Rime"
   "2"

   'fcitx5
   )

  ;; enable the /cursor color/ mode
  (sis-global-cursor-color-mode t)
  ;; enable the /respect/ mode
  (sis-global-respect-mode -1)
  ;; enable the /context/ mode for all buffers
  (sis-global-context-mode 1)
  ;; enable the /inline english/ mode for all buffers
  ;; (sis-global-inline-mode t)

  ;; org title 处切换 Rime，telega 聊天时切换 Rime。
  ;; 使用模式编辑 meow，需要额外加 meow-insert-mode 条件。
  (add-to-list 'sis-context-detectors
               (lambda (&rest _)
                 (when (and meow-insert-mode
                            (or (derived-mode-p 'org-mode
                                                'telega-chat-mode
                                                )))
                   'other)))

  (defun +meow-focus-change-function ()
    (if (frame-focus-state)
        (sis-set-english)
      (meow-insert-exit)))

  (add-function :after after-focus-change-function '+meow-focus-change-function)
  )

(leaf ace-window
  :straight t
  :bind (("C-x o" . ace-window)))

(leaf mwim
  :straight t
  :bind
  ("C-a" . mwim-beginning-of-code-or-line)
  ("C-e" . mwim-end-of-code-or-line))

(leaf doom-modeline
  :straight t
  :global-minor-mode t
  :custom
  (doom-modeline-modal-icon . t)
  )

(leaf good-scroll
  :straight t
  :global-minor-mode t
  :when *is-gui*          ; 在图形化界面时才使用这个插件
  )

(leaf which-key
  :straight t
  :global-minor-mode t
  )

(leaf avy
  :straight t
  :bind
  ("C-c j j" . avy-goto-char-timer)
  ("C-c j l" . avy-goto-line)
  )

;; Enable rich annotations using the Marginalia package
(leaf marginalia
  :straight t
  :global-minor-mode t
  ;; Bind `marginalia-cycle' locally in the minibuffer.  To make the binding
  ;; available in the *Completions* buffer, add it to the
  ;; `completion-list-mode-map'.
  :bind
  (:minibuffer-local-map
   ("M-A" . marginalia-cycle))
  )

(defun delete-current-file ()
  "Delete the file associated with the current buffer. Delete the current buffer too. If no file is associated, just close buffer without prompt for save."
  (interactive)
  (let ((currentFile (buffer-file-name)))
    (when (yes-or-no-p (concat "Delete file?: " currentFile))
      (kill-buffer (current-buffer))
      (when currentFile (delete-file currentFile)))))

;; Example configuration for Consult
(leaf consult
  :straight t
  :ensure-system-package (rg . ripgrep)
  :bind
  ("C-c b b" . consult-buffer)
  ("C-c p s" . consult-ripgrep)
  ("C-c f f" . find-file)
  ("C-c f d" . delete-current-file)
  ("C-c f e" . consult-recent-file)
  ("C-c j g" . consult-goto-line)            ;; orig. goto-line
  ("C-c j m" . consult-imenu)
  ("C-c j s" . consult-line)                ;; orig. previous-matching-history-element

  ;; Enable automatic preview at point in the *Completions* buffer. This is
  ;; relevant when you use the default completion UI.
  :hook
  (completion-list-mode-hook . consult-preview-at-point-mode)

  ;; The :init configuration is always executed (Not lazy)
  :custom
  ;; Optionally configure the register formatting. This improves the register
  ;; preview for `consult-register', `consult-register-load',
  ;; `consult-register-store' and the Emacs built-ins.
  (register-preview-delay . 0.5)
  (register-preview-function . #'consult-register-format)
  ;; Use Consult to select xref locations with preview
  (xref-show-xrefs-function . #'consult-xref)
  (xref-show-definitions-function . #'consult-xref)
  ;; Optionally configure the narrowing key.
  ;; Both < and C-+ work reasonably well.
  (consult-narrow-key . "<") ;; "C-+"

  ;; Optionally tweak the register preview window.
  ;; This adds thin lines, sorting and hides the mode line of the window.
  :init
  (advice-add #'register-preview :override #'consult-register-window)

  ;; Configure other variables and modes in the :config section,
  ;; after lazily loading the package.
  :config

  ;; Optionally configure preview. The default value
  ;; is 'any, such that any key triggers the preview.
  ;; (setq consult-preview-key 'any)
  ;; (setq consult-preview-key "M-.")
  ;; (setq consult-preview-key '("S-<down>" "S-<up>"))
  ;; For some commands and buffer sources it is useful to configure the
  ;; :preview-key on a per-command basis using the `consult-customize' macro.
  (consult-customize
   consult-theme :preview-key '(:debounce 0.2 any)
   consult-ripgrep consult-git-grep consult-grep
   consult-bookmark consult-recent-file
   ;; consult-xref
   consult--source-bookmark consult--source-file-register
   consult--source-recent-file consult--source-project-recent-file
   ;; :preview-key "M-."
   :preview-key '(:debounce 0.4 any))


  ;; Optionally make narrowing help available in the minibuffer.
  ;; You may want to use `embark-prefix-help-command' or which-key instead.
  ;; (define-key consult-narrow-map (vconcat consult-narrow-key "?") #'consult-narrow-help)

  ;; By default `consult-project-function' uses `project-root' from project.el.
  ;; Optionally configure a different project root function.
    ;;;; 1. project.el (the default)
  ;; (setq consult-project-function #'consult--default-project-function)
    ;;;; 2. vc.el (vc-root-dir)
  ;; (setq consult-project-function (lambda (_) (vc-root-dir)))
    ;;;; 3. locate-dominating-file
  ;; (setq consult-project-function (lambda (_) (locate-dominating-file "." ".git")))
  ;; 4. projectile.el (projectile-project-root)
  (autoload 'projectile-project-root "projectile")
  (setq consult-project-function (lambda (_) (projectile-project-root)))
    ;;;; 5. No project support
  ;; (setq consult-project-function nil)
  )

(leaf vertico
  :straight t
  :global-minor-mode t
  :custom
  ;; Show more candidates
  (vertico-count . 20)

  ;; Grow and shrink the Vertico minibuffer
  (vertico-resize . t)

  ;; Optionally enable cycling for `vertico-next' and `vertico-previous'.
  (vertico-cycle . t)
  )

(leaf embark
  :straight t
  :bind
