README.org
** embark

embark 是另一个比较神奇的工具。Emacs 基本的操作流程是先输入命令再输入命令作用的对象。例如，我们先按下 C-x C-f 再输入文件名来打开文件。但是有的时候，我们按下命令、选择了文件后，可能又后悔了，想要对相同的文件输入另一个命令。例如我们按下 C-x k 打算关闭一个后台 buffer，然后输入了文件名，这时我们忽然想再查看一眼那个文件。那么平常，我们只好按下 C-g 放弃这次命令，再用 C-x b 切换过去。而有了 embark ，我们可以在按下 C-x k 、输入了部分文件名选中文件后 ，按下 C-. 触发 embark- act，这时按下 o 就可以在另一个新的窗口打开这个 buffer 了。我们无需放弃命令重新输入，而是继续输入就好了。

#+begin_src emacs-lisp
  (leaf embark
    :straight t
    :bind
    (("C-." . embark-act)         ;; pick some comfortable binding
     ("C-;" . embark-dwim)        ;; good alternative: M-.
     ("C-h B" . embark-bindings)) ;; alternative for `describe-bindings'

    :custom

    ;; Optionally replace the key help with a completing-read interface
    (prefix-help-command . #'embark-prefix-help-command)

    ;; Show the Embark target at point via Eldoc. You may adjust the
    ;; Eldoc strategy, if you want to see the documentation from
    ;; multiple providers. Beware that using this can be a little
    ;; jarring since the message shown in the minibuffer can be more
    ;; than one line, causing the modeline to move up and down:

    ;; (add-hook 'eldoc-documentation-functions #'embark-eldoc-first-target)
    ;; (setq eldoc-documentation-strategy #'eldoc-documentation-compose-eagerly)

    :config

    ;; Hide the mode line of the Embark live/completions buffers
    (add-to-list 'display-buffer-alist
                 '("\\`\\*Embark Collect \\(Live\\|Completions\\)\\*"
                   nil
                   (window-parameters (mode-line-format . none)))))

  ;; Consult users will also want the embark-consult package.
  (leaf embark-consult
    :straight t ; only need to install it, embark loads it after consult if found
    :after (consult embark)
    :hook
    (embark-collect-mode-hook . consult-preview-at-point-mode))
#+end_src

** orderless
一个模糊搜索的插件，可以为多个其它插件提供排序函数
#+begin_src emacs-lisp
  (leaf orderless
    :straight t
    :custom
    ;; Configure a custom style dispatcher (see the Consult wiki)
    ;; (setq orderless-style-dispatchers '(+orderless-consult-dispatch orderless-affix-dispatch)
    ;;       orderless-component-separator #'orderless-escapable-split-on-space)
    (completion-styles . '(orderless basic))
    (completion-category-defaults . nil)
    (completion-category-overrides . '((file (styles partial-completion))))
    )
#+end_src

** rainbow-delimiters

这个插件可以用不同颜色标记多级括号，方便看清代码块（尤其在 EmacsLisp 中）。

#+begin_src emacs-lisp
  ;; 括号的多色彩
  (leaf rainbow-delimiters
    :straight t
    :hook
    (prog-mode-hook . rainbow-delimiters-mode)
    )
#+end_src

** transient
#+begin_src emacs-lisp
  (leaf transient
    :straight t
    :custom
    `(transient-levels-file . ,(expand-emacs-state "transient/levels.el"))
    `(transient-values-file . ,(expand-emacs-state "transient/values.el"))
    `(transient-history-file . ,(expand-emacs-state "transient/history.el"))
    )
#+end_src
* 应用程序

** COMMENT EAF

现在这个功能还不好用。

待解决的问题
- [ ] 封装每个应用为一个 nixpkg
- [ ] 和Meow模式的集成

目前的安装方式
1. 克隆到指定的目录
2. 使用 =nix-shell -p pkg-config libinput libevdev= 进入编译环境
3. 使用 =./install-eaf.py --ignore-core-deps= 安装所需依赖

#+begin_src emacs-lisp
  (leaf eaf
    :straight '(eaf :type git :host github :repo "emacs-eaf/emacs-application-framework"
                    ;; :files (:defaults "*")
                    :files (:defaults "*.el" "*.py" "*.json" "extension" "core" "reinput")
                    )

    ;; :load-path (expand-file-name
    ;;             "workspace/forks/emacs-application-framework"
    ;;             (getenv "HOME")
    ;;             )

    ;; :init
    ;; :config
    ;; (add-to-list 'meow-mode-state-list '(eaf-mode . motion))
    )

  (leaf eaf-browser
    :after eaf
    :require t
    :load-path "~/.local/state/emacs/straight/repos/emacs-application-framework/app/browser/"
    :custom
    (eaf-browser-continue-where-left-off . t)
    (eaf-browser-enable-adblocker . t)
    (browse-url-browser-function . 'eaf-open-browser)

    :config
    (defalias 'browse-web #'eaf-open-browser)
    ;; (eaf-bind-key scroll_up "C-n" eaf-pdf-viewer-keybinding)
    ;; (eaf-bind-key scroll_down "C-p" eaf-pdf-viewer-keybinding)
    ;; (eaf-bind-key take_photo "p" eaf-camera-keybinding)
    ;; (eaf-bind-key nil "M-q" eaf-browser-keybinding) ;; unbind, see more in the Wiki
    ;; (eaf-bind-key nil "SPC" eaf-browser-keybinding) ;; unbind, see more in the Wiki
    )
  (leaf eaf-file-manager
    :after eaf
    :require t
    :load-path "~/.local/state/emacs/straight/repos/emacs-application-framework/app/file-manager/"
    ;; :custom
    ;; (eaf-browser-continue-where-left-off . t)
    ;; (eaf-browser-enable-adblocker . t)
    ;; (browse-url-browser-function . 'eaf-open-browser)

    ;; :config
    ;; (defalias 'browse-web #'eaf-open-browser)
    ;; (eaf-bind-key scroll_up "C-n" eaf-pdf-viewer-keybinding)
    ;; (eaf-bind-key scroll_down "C-p" eaf-pdf-viewer-keybinding)
    ;; (eaf-bind-key take_photo "p" eaf-camera-keybinding)
    ;; (eaf-bind-key nil "M-q" eaf-browser-keybinding) ;; unbind, see more in the Wiki
    ;; (eaf-bind-key nil "SPC" eaf-browser-keybinding) ;; unbind, see more in the Wiki
    )
#+end_src

** mu4e - 邮件
收邮件方案是使用 offlineimap 进行邮件的同步，由 mu 对邮箱进行索引，前端使用 mu4e 进行管理。
发邮件的方案是 使用 msmtp

目前只在 nix 相关的环境下可用

#+begin_src emacs-lisp
  (leaf mu4e
    :when *is-nix-module*
    :ensure-system-package mu offlineimap
    :custom
    (user-full-name . "Leo Liu")
    (user-mail-address . "hi@grass.show")

    (sendmail-program . "msmtp")
    (mail-user-agent . 'mu4e-user-agent)

    (send-mail-function . 'smtpmail-send-it)
    (message-sendmail-f-is-evil . t)
    (message-sendmail-extra-arguments . '("--read-envelope-from"))
    (message-send-mail-function . 'message-send-mail-with-sendmail)

    (mu4e-attachment-dir .  "~/Downloads")
    (mu4e-get-mail-command . "offlineimap -o")
    (mu4e-update-interval . 300)
    (mu4e-notification-support . t)

    :init
    ;; 定时更新索引
    (run-with-idle-timer (* 5 60) t 'mu4e-update-index)
    :config
    ;; 默认是motion模式
    (add-to-list 'meow-mode-state-list '(mu4e-view-mode . motion))
    ;; allow for updating mail using 'U' in the main view:

    :commands mu4e-update-index
    :bind
    ("C-c a m" . mu4e)
    ("C-c t m" . mu4e-update-mail-and-index)
    )
#+end_src


** RSS

#+begin_src emacs-lisp
  (leaf elfeed-protocol
    :straight t
    :ensure-system-package rbw
    :custom
    (elfeed-use-curl . t)
    `(elfeed-db-directory . ,(expand-emacs-cache "elfeed"))
    (elfeed-curl-extra-arguments . '("--insecure")) ;necessary for https without a trust certificate
    ;; (setq elfeed-protocol-fever-update-unread-only nil)
    (elfeed-protocol-fever-fetch-category-as-tag . t)
    (elfeed-protocol-fever-update-unread-only . t)
    ;; setup feeds
    (elfeed-protocol-feeds .
          '(
            ("fever+https://grass@rss.grass.work:30443"
             :api-url "https://grass@rss.grass.work:30443/fever/"
             :password  (grass-emacs/get-bitwarden-password "miniflux-fever"))
            ))

    ;; enable elfeed-protocol
    (elfeed-protocol-enabled-protocols . '(fever))
    (elfeed-curl-timeout . 36000)
    :require t
    :config
    (elfeed-protocol-enable)
    :bind
    ("C-c a r" . elfeed)
    )
#+end_src


** Pocket

用于阅读和管理稍后阅读列表

#+begin_src emacs-lisp
  (leaf pocket-reader
    :straight t
    :after elfeed
    :custom
    (pocket-reader-open-url-default-function . #'eww)
    :bind
    ("C-c a p" . pocket-reader)
    (:elfeed-search-mode-map
          ("P" . pocket-reader-elfeed-search-add-link)
          )
    (:elfeed-show-mode-map
          ("P" . pocket-reader-elfeed-entry-add-link)
          )

    )
#+end_src

** 浏览器

#+begin_src emacs-lisp
  (leaf eww
    )
#+end_src

* 补全

列表补全使用的是 =vertico= / =marginalia= / =consult= / =orderless= 全家桶

#+begin_src emacs-lisp
  ;; Use Dabbrev with Corfu!
  (leaf yasnippet
    :straight t
    :global-minor-mode yas-global-mode
    :custom
    `(yas--default-user-snippets-dir . ,(expand-emacs-data "snippets"))
    )

#+end_src

* LSP-Bridge
** GUI
#+begin_src emacs-lisp
  (leaf lsp-bridge
    :straight '(lsp-bridge :type git :host github :repo "manateelazycat/lsp-bridge"
                           :files (:defaults "*.el" "*.py" "acm" "core" "langserver" "multiserver" "resources")
                           :build (:not compile)
                           )
    :leaf-defer nil
    :custom
    ;; ui
    (acm-enable-preview . t)
    (lsp-bridge-enable-log . nil)
    ;; 用户级别的lsp-bridge配置
    (lsp-bridge-user-langserver-dir . "~/.config/emacs/lsp-bridge-user/langserver")
    (lsp-bridge-php-lsp-server . 'phpactor)
    ;; codeium
    (acm-enable-codeium . t)
    (lsp-bridge-enable-completion-in-string . t)
    ;; formatter
    (lsp-bridge-enable-auto-format-code . nil)
    (lsp-bridge-auto-format-code-idle . nil)
    :hook
    (vue-mode-hook . lsp-bridge-mode)

    :config
    (add-to-list 'meow-mode-state-list '(lsp-bridge-ref-mode . motion))
    (global-lsp-bridge-mode)

    :bind
    ("M-." . lsp-bridge-find-def)
    ("M-," . lsp-bridge-find-def-return)

    ("C-c t l" . lsp-bridge-mode)
    )
#+end_src


** TUI Patch (ace-terminal)

由于 =lsp-bridge= 不支持 =TUI=, 单独装一个包来支持 =TUI=
#+begin_src emacs-lisp

  (leaf acm-terminal
    :when *is-tui*
    :straight '(popon :host nil :repo "https://codeberg.org/akib/emacs-popon.git")
    :straight '(acm-terminal :host github :repo "twlz0ne/acm-terminal")
    )
#+end_src


