init.el
  (("C-." . embark-act)         ;; pick some comfortable binding
   ("C-;" . embark-dwim)        ;; good alternative: M-.
   ("C-h B" . embark-bindings)) ;; alternative for `describe-bindings'

  :custom

  ;; Optionally replace the key help with a completing-read interface
  (prefix-help-command . #'embark-prefix-help-command)

  ;; Show the Embark target at point via Eldoc. You may adjust the
  ;; Eldoc strategy, if you want to see the documentation from
  ;; multiple providers. Beware that using this can be a little
  ;; jarring since the message shown in the minibuffer can be more
  ;; than one line, causing the modeline to move up and down:

  ;; (add-hook 'eldoc-documentation-functions #'embark-eldoc-first-target)
  ;; (setq eldoc-documentation-strategy #'eldoc-documentation-compose-eagerly)

  :config

  ;; Hide the mode line of the Embark live/completions buffers
  (add-to-list 'display-buffer-alist
               '("\\`\\*Embark Collect \\(Live\\|Completions\\)\\*"
                 nil
                 (window-parameters (mode-line-format . none)))))

;; Consult users will also want the embark-consult package.
(leaf embark-consult
  :straight t ; only need to install it, embark loads it after consult if found
  :after (consult embark)
  :hook
  (embark-collect-mode-hook . consult-preview-at-point-mode))

(leaf orderless
  :straight t
  :custom
  ;; Configure a custom style dispatcher (see the Consult wiki)
  ;; (setq orderless-style-dispatchers '(+orderless-consult-dispatch orderless-affix-dispatch)
  ;;       orderless-component-separator #'orderless-escapable-split-on-space)
  (completion-styles . '(orderless basic))
  (completion-category-defaults . nil)
  (completion-category-overrides . '((file (styles partial-completion))))
  )

;; 括号的多色彩
(leaf rainbow-delimiters
  :straight t
  :hook
  (prog-mode-hook . rainbow-delimiters-mode)
  )

(leaf transient
  :straight t
  :custom
  `(transient-levels-file . ,(expand-emacs-state "transient/levels.el"))
  `(transient-values-file . ,(expand-emacs-state "transient/values.el"))
  `(transient-history-file . ,(expand-emacs-state "transient/history.el"))
  )

(leaf mu4e
  :when *is-nix-module*
  :ensure-system-package mu offlineimap
  :custom
  (user-full-name . "Leo Liu")
  (user-mail-address . "hi@grass.show")

  (sendmail-program . "msmtp")
  (mail-user-agent . 'mu4e-user-agent)

  (send-mail-function . 'smtpmail-send-it)
  (message-sendmail-f-is-evil . t)
  (message-sendmail-extra-arguments . '("--read-envelope-from"))
  (message-send-mail-function . 'message-send-mail-with-sendmail)

  (mu4e-attachment-dir .  "~/Downloads")
  (mu4e-get-mail-command . "offlineimap -o")
  (mu4e-update-interval . 300)
  (mu4e-notification-support . t)

  :init
  ;; 定时更新索引
  (run-with-idle-timer (* 5 60) t 'mu4e-update-index)
  :config
  ;; 默认是motion模式
  (add-to-list 'meow-mode-state-list '(mu4e-view-mode . motion))
  ;; allow for updating mail using 'U' in the main view:

  :commands mu4e-update-index
  :bind
  ("C-c a m" . mu4e)
  ("C-c t m" . mu4e-update-mail-and-index)
  )

(leaf elfeed-protocol
  :straight t
  :ensure-system-package rbw
  :custom
  (elfeed-use-curl . t)
  `(elfeed-db-directory . ,(expand-emacs-cache "elfeed"))
  (elfeed-curl-extra-arguments . '("--insecure")) ;necessary for https without a trust certificate
  ;; (setq elfeed-protocol-fever-update-unread-only nil)
  (elfeed-protocol-fever-fetch-category-as-tag . t)
  (elfeed-protocol-fever-update-unread-only . t)
  ;; setup feeds
  (elfeed-protocol-feeds .
        '(
          ("fever+https://grass@rss.grass.work:30443"
           :api-url "https://grass@rss.grass.work:30443/fever/"
           :password  (grass-emacs/get-bitwarden-password "miniflux-fever"))
          ))

  ;; enable elfeed-protocol
  (elfeed-protocol-enabled-protocols . '(fever))
  (elfeed-curl-timeout . 36000)
  :require t
  :config
  (elfeed-protocol-enable)
  :bind
  ("C-c a r" . elfeed)
  )

(leaf pocket-reader
  :straight t
  :after elfeed
  :custom
  (pocket-reader-open-url-default-function . #'eww)
  :bind
  ("C-c a p" . pocket-reader)
  (:elfeed-search-mode-map
        ("P" . pocket-reader-elfeed-search-add-link)
        )
  (:elfeed-show-mode-map
        ("P" . pocket-reader-elfeed-entry-add-link)
        )

  )

(leaf eww
  )

;; Use Dabbrev with Corfu!
(leaf yasnippet
  :straight t
  :global-minor-mode yas-global-mode
  :custom
  `(yas--default-user-snippets-dir . ,(expand-emacs-data "snippets"))
  )

(leaf lsp-bridge
  :straight '(lsp-bridge :type git :host github :repo "manateelazycat/lsp-bridge"
                         :files (:defaults "*.el" "*.py" "acm" "core" "langserver" "multiserver" "resources")
                         :build (:not compile)
                         )
  :leaf-defer nil
  :custom
  ;; ui
  (acm-enable-preview . t)
  (lsp-bridge-enable-log . nil)
  ;; 用户级别的lsp-bridge配置
  (lsp-bridge-user-langserver-dir . "~/.config/emacs/lsp-bridge-user/langserver")
  (lsp-bridge-php-lsp-server . 'phpactor)
  ;; codeium
  (acm-enable-codeium . t)
  (lsp-bridge-enable-completion-in-string . t)
  ;; formatter
  (lsp-bridge-enable-auto-format-code . nil)
  (lsp-bridge-auto-format-code-idle . nil)
  :hook
  (vue-mode-hook . lsp-bridge-mode)

  :config
  (add-to-list 'meow-mode-state-list '(lsp-bridge-ref-mode . motion))
  (global-lsp-bridge-mode)

  :bind
  ("M-." . lsp-bridge-find-def)
  ("M-," . lsp-bridge-find-def-return)

  ("C-c t l" . lsp-bridge-mode)
  )

(leaf acm-terminal
  :when *is-tui*
  :straight '(popon :host nil :repo "https://codeberg.org/akib/emacs-popon.git")
  :straight '(acm-terminal :host github :repo "twlz0ne/acm-terminal")
  )
