README.org
* 项目工程

#+begin_src emacs-lisp


  (defun projectile-run-vterm ()
    (interactive)
    (let* ((project (projectile-ensure-project (projectile-project-root)))
           (buffer "vterm"))
      (require 'vterm)
      (if (buffer-live-p (get-buffer buffer))
          (switch-to-buffer buffer)
        (vterm))
      (vterm-send-string (concat "cd " project))
      (vterm-send-return)))


  (leaf vterm
    :straight t
    :config
    (add-to-list 'meow-mode-state-list '(vterm-mode . insert))

    :bind
    ("C-c b t" . vterm)
    )
#+end_src
** Project
#+begin_src emacs-lisp
  (leaf project
    :config
    (setq project-list-file (expand-emacs-state "projects"))
    :bind
    ("C-c p f" . project-find-file)
    ("C-c p d" . project-find-dir)
    ("C-c p b" . consult-project-buffer)
    )
#+end_src
** Projectile
#+begin_src emacs-lisp
  (leaf projectile
    :straight t
    :global-minor-mode projectile-mode
    :custom
    ;; 关闭启动时的自动项目发现
    (projectile-auto-discover . nil)
    `(projectile-known-projects-file . ,(expand-emacs-state "projectile-known-projects.eld"))
    (projectile-project-search-path . '(
                                        ("~/workspace" . 2)
                                        "~/workspace/mugeda"
                                        ))
    :bind
    ("C-c p R" . projectile-replace)
    )

  ;; 绑定 consult-projectile
  (leaf consult-projectile
    :straight t
    :bind
    ("C-c p p" . consult-projectile-switch-project)
    ("C-c p 4 f" . consult-projectile-find-file-other-window)
    )
#+end_src
** Magit
支持 Git 的使用，同时使用 =magit-todos= 增强TODO关键词的展示
#+begin_src emacs-lisp
  (leaf magit
    :straight t
    :bind
    ("C-c p v" . magit)
    )

#+end_src

* Org
Org-mode 相关的配置。

我目前只使用 =Org-mode= 来管理我的 =Emacs= 配置。后续再逐步用于任务管理，项目管理，笔记管理等用途。

** Org base
#+begin_src emacs-lisp

  ;; Org模式相关的，和GTD相关的
  (leaf org
    :ensure-system-package (pandoc zip)
    :custom
    ;; Edit settings
    (org-auto-align-tags . t)
    (org-tags-column . 0)
    (org-catch-invisible-edits . 'show-and-error)
    (org-special-ctrl-a/e . t)
    (org-insert-heading-respect-content . t)

    (org-protocol-default-template-key . "n")

    ;; Org styling, hide markup etc.
    (org-hide-emphasis-markers . t)
    (org-pretty-entities . t)

    (org-directory . "~/org/")
    (org-startup-folded . 'nofold)
    (org-refile-targets . '(
                            (nil . (:level . 1)) ;当前文件的level1
                            (nil . (:tag . "project"))
                            ("~/org/gtd/gtd.org" . (:tag . "inbox"))
                            ))
    (org-todo-keywords . '(
                           (sequence "NEXT(n)" "TODO(t)"  "WAITING(w@)" "SOMEDAY(s)" "|" "DONE(d!)" "CANCELLED(c@)")
                           ))
    (org-clock-string-limit . 5)
    (org-log-refile . 'nil)
    (org-log-done . 'time)
    (org-log-into-drawer . "LOGBOOK")

    (org-clock-stored-history . t)
    (org-clock-auto-clockout-timer . 1800)
    (org-tag-alist . '(
                       ;; 上下文需求
                       (:startgroup . nil)
                       ("@home" . ?h)
                       ("@office" . ?o)
                       ("@phone" . ?f)
                       ("@pc" . ?c)
                       (:endgroup . nil)
                       ;; 类型
                       ("task" . ?t)
                       ("project" . ?p)
                       ("event" . ?e)
                       ))
    (org-capture-templates . '(
                               ("T" "带上下文捕获任务" entry (file+headline  "~/org/gtd/gtd.org" "Inbox For GTD") "* TODO %?\n:PROPERTIES:\n:CREATED: %U\n:RELATED: %a\n:END:")
                               ("t" "捕获任务" entry (file+headline  "~/org/gtd/gtd.org" "Inbox For GTD") "* TODO %?\n")
                               ("n" "摘抄" entry (file  "~/org/inbox/emacs.org") "* TODO 摘抄自 %a \n:PROPERTIES:\n:CREATED: %U\n:RELATED: %a\n:END:\n%i\n" :immediate-finish t)
                               ("x" "快速捕获任务" entry (file+headline  "~/org/gtd/gtd.org" "Inbox For GTD") "* TODO %l \nSCHEDULED: %t\n" :immediate-finish t)
                               ))
    :config
    (org-clock-auto-clockout-insinuate)
    (defun grass-emacs/next-monday ()
      (org-read-date nil nil "Mon"))

    (defun grass-emacs/current-monday ()
      (org-read-date nil nil "-Mon"))

    (defun grass-emacs/last-monday ()
      (org-read-date nil nil "--1w" nil (date-to-time (grass-emacs/current-monday))))


    :bind
    ("C-c n s" . org-save-all-org-buffers)
    ("C-c n c" . org-capture)
    :hook
    (org-capture-after-finalize-hook . org-save-all-org-buffers)
    (org-after-tags-change-hook . org-save-all-org-buffers)
    (org-after-refile-insert-hook . org-save-all-org-buffers)
    (org-after-todo-state-change-hook . org-save-all-org-buffers)
    )

  (leaf org-contrib
    :straight t
    )

#+end_src

