README.org
** Org Agenda
和日程相关的配置。
#+begin_src emacs-lisp
  (leaf org-agenda
    :after org
    :custom
    ;; 除了gtd的，还有各种外部收集箱中的未整理的也要显示
    (org-agenda-files . '("~/org/gtd/gtd.org" "~/org/inbox"))
    (org-agenda-tags-column . 0)
    (org-agenda-include-diary . t)
    (org-agenda-show-future-repeats . 'next)
    ;; 在agenda视图中默认显示实体文本内容，且最多10行
    (org-agenda-start-with-entry-text-mode . t)
    (org-agenda-entry-text-maxlines . 3)

    (org-agenda-custom-commands . `(
                                    ("i" "外部收集箱" tags "+inbox" ((org-agenda-files '("~/org/inbox" "~/org/sync"))))
                                    ("j" "所有待细化的项目" tags "inbox"
                                     (
                                      (org-agenda-files '("~/org/gtd/gtd.org"))
                                      (org-agenda-skip-function '(org-agenda-skip-entry-if 'regexp "Inbox For GTD"))
                                      ))

                                    ("p" "每周项目回顾" tags-tree "+project" )

                                    ("r" . "回顾统计")
                                    ("rt" "今日完成任务"
                                     tags "+CLOSED>=\"<today>\"|+LAST_REPEAT>=\"<today>\"-habit|+TIMESTAMP>=\"<today>\"+TIMESTAMP<\"<tomorrow>\"-habit"
                                     ((org-agenda-overriding-header "今日完成的任务")
                                      (org-agenda-sorting-strategy '(priority-down))
                                      (org-agenda-start-with-entry-text-mode . nil)
                                      )
                                     nil)

                                    ("ry" "昨日完成任务"
                                     tags "+CLOSED>=\"<-1d>\"+CLOSED<\"<today>\"|+LAST_REPEAT>=\"<-1d>\"+LAST_REPEAT<\"<today>\"-habit|+TIMESTAMP>=\"<-1d>\"+TIMESTAMP<\"<today>\"-habit"
                                     ((org-agenda-overriding-header "昨日完成的任务")
                                      (org-agenda-sorting-strategy '(priority-down))
                                      (org-agenda-start-with-entry-text-mode . nil)
                                      )
                                     nil)

                                    ("rw" "本周完成任务"
                                     tags ,(let ((monday (grass-emacs/current-monday)))
                                             (format "+CLOSED>=\"<%s>\"|+LAST_REPEAT>=\"<%s>\"-habit|+TIMESTAMP>=\"<%s>\"+TIMESTAMP<=\"<now>\"-habit" monday monday monday))
                                     ((org-agenda-overriding-header "本周完成的任务")
                                      (org-agenda-sorting-strategy '(priority-down))
                                      (org-agenda-start-with-entry-text-mode . nil)
                                      )
                                     nil)

                                    ("rp" "上周完成任务"
                                     tags ,(let (
                                                 (monday (grass-emacs/current-monday))
                                                 (last-monday (grass-emacs/last-monday)))
                                             (format
                                              "+CLOSED>=\"<%s>\"+CLOSED<\"<%s>\"|+LAST_REPEAT>=\"<%s>\"+LAST_REPEAT<\"<%s>\"-habit|+TIMESTAMP>=\"<%s>\"+TIMESTAMP<\"<%s>\"-habit"
                                              last-monday monday last-monday monday last-monday monday))
                                     ((org-agenda-overriding-header "上周完成的任务")
                                      (org-agenda-sorting-strategy '(priority-down))
                                      (org-agenda-start-with-entry-text-mode . nil)
                                      )
                                     nil)

                                    ))

    :bind
    ("C-c n a" . org-agenda)
    ("C-c n n" . org-agenda-list)
    )
#+end_src
** Org Habit
#+begin_src emacs-lisp
  (leaf org-habit
    :custom
    (org-habit-show-habits . t)
    (org-habit-following-days . 2)
    (org-habit-preceding-days . 7)
    (org-habit-graph-column . 60)
    :require t
    :push ((org-modules . 'habit)
           )
    )
#+end_src
** Org Pomodoro 番茄钟
#+begin_src emacs-lisp
  (leaf org-pomodoro
    :straight t
    :config
    (defun org-pomodoro-notify (title message)
      "Send a notification with TITLE and MESSAGE using `alert'."
      (notifications-notify :body message :title title :timeout (* 5 * 60 * 1000)))
    :bind
    ("C-c n p" . org-pomodoro)
    (:org-agenda-mode-map
     ("C-c C-x C-p" . org-pomodoro))
     (:org-mode-map
     ("C-c C-x C-p" . org-pomodoro))
    )
#+end_src
** Org-roam
#+begin_src emacs-lisp
  (leaf org-roam
    :straight t
    :require org-roam org-roam-protocol
    :ensure-system-package
    (dot . graphviz)
    :after org
    :custom
    (org-roam-directory . "~/org/roam/")
    `(org-roam-node-display-template . ,(concat "${title:*} " (propertize "${tags:10}" 'face 'org-tag)))
    :bind
    ("C-c n f" . org-roam-node-find)
    ("C-c n g" . org-roam-graph)
    ("C-c n i" . org-roam-node-insert)
    ("C-c n C" . org-roam-capture)
    ;; Dailies
    ("C-c n j" . org-roam-dailies-capture-today)

    :config
    (org-roam-db-autosync-mode)
    )

  (leaf consult-org-roam
     :straight t
     :after org-roam
     :require t
     :global-minor-mode t
     :custom
     ;; Use `ripgrep' for searching with `consult-org-roam-search'
     (consult-org-roam-grep-func . 'consult-ripgrep)
     ;; Configure a custom narrow key for `consult-buffer'
     (consult-org-roam-buffer-narrow-key . ?r)
     ;; Display org-roam buffers right after non-org-roam buffers
     ;; in consult-buffer (and not down at the bottom)
     (consult-org-roam-buffer-after-buffers . t)
     :config
     ;; Eventually suppress previewing for certain functions
     (consult-customize
      consult-org-roam-forward-links
      :preview-key "M-.")
     :bind
     ;; Define some convenient keybindings as an addition
     ("C-c n e" . consult-org-roam-file-find)
     ("C-c n b" . consult-org-roam-backlinks)
     ("C-c n B" . consult-org-roam-backlinks-recursive)
     ("C-c n l" . consult-org-roam-forward-links)
     ("C-c n r" . consult-org-roam-search))
#+end_src

** Org-Mordern
#+begin_src emacs-lisp
  ;; org 美化
  (leaf org-modern
    :straight t
    :hook
    (org-mode-hook . org-modern-mode)
    (org-agenda-finalize-hook . org-modern-agenda)
    :custom
    (org-modern-todo-faces . '(
                               ("NEXT" :background "red"
                                :foreground "white")
                               ("SOMEDAY" :background "gray"
                                :foreground "black")
                               ))

    )
#+end_src
** Ox-hugo
#+begin_src emacs-lisp
  (leaf ox-hugo
    :straight t
    :after ox
    :require t
    :leaf-defer nil
    :ensure-system-package hugo
    :custom
    (org-hugo-section . "post")
    (org-hugo-auto-set-lastmod	. t)
    :init
    (add-to-list 'org-capture-templates
                 '("h"
                   "Hugo draft"
                   entry
                   (file+olp "~/org/blog/draft.org" "Draft")
                   (function org-hugo-new-subtree-post-capture-template)))

    )

  (with-eval-after-load 'org-capture
        (defun org-hugo-new-subtree-post-capture-template ()
          "Return `org-capture' template string for new Hugo post."
          (let* ((date (format-time-string (org-time-stamp-format :long :inactive) (org-current-time)))
                 (title (read-from-minibuffer "Post Title: "))
                 (file-name (read-from-minibuffer "File Name: "))
                 (fname (org-hugo-slug file-name)))
            (mapconcat #'identity
                       `(
                         ,(concat "* TODO " title)
                         ":PROPERTIES:"
                         ,(concat ":EXPORT_FILE_NAME: " fname)
                         ,(concat ":EXPORT_DATE: " date)
                         ":END:"
                         "%?\n")
                       "\n")))

        )
#+end_src
