README.org
** Org Caldav
#+begin_src emacs-lisp
  (leaf org-caldav
    :straight t
    :ensure-system-package rbw
    :custom
    ;; 双向同步
    (org-caldav-sync-direction . 'twoway)

    (org-caldav-exclude-tags . '("no_caldav"))
    (org-caldav-todo-percent-states  . '(
                                         (0 "TODO")
                                         (10 "NEXT")
                                         (100 "DONE")
                                         ))

    ;; ;; 如果上一次异常，不询问
    (org-caldav-resume-aborted . 'always)

    ;; 同步过程中自动删除条目，不再询问(我的本地org使用了git存储)
    ;; org-caldav-delete-org-entries 'always
    (org-caldav-delete-calendar-entries . 'always)

    ;; 不导出 VTODO
    (org-caldav-sync-todo . t)
    (org-icalendar-include-todo . '("TODO" "NEXT"))

    ;; 如果不是是todo节点，会作为一个event
    (org-icalendar-use-scheduled . '(todo-start event-if-not-todo))

    ;; 如果不是todo节点，会作为一个event
    (org-icalendar-use-deadline . '(todo-due event-if-not-todo))

    ;; 不使用sexp
    (org-icalendar-include-sexps . nil)
    (org-icalendar-include-bbdb-anniversaries . nil)

    ;; 后台导出，不显示同步结果
    (org-caldav-show-sync-results . nil)
    ;; debug logs
    (org-caldav-debug-level . 1)
    :init
    ;; 多个日历
    (setq org-caldav-calendars (list (list
                                      :url (concat "https://grass:" (grass-emacs/get-bitwarden-password "carddav:grass") "@carddav.grass.work:30443/grass")
                                      :calendar-id "34a7e558-4066-efe4-69f7-15ada01bc7b6" ; 个人日历
                                      :select-tags (list "personal" "work")
                                      :files '("~/org/gtd/gtd.org")
                                      :inbox "~/org/inbox/caldav-personal.org")
                                     (list
                                      :url (concat "https://family:" (grass-emacs/get-bitwarden-password "carddav:family") "@carddav.grass.work:30443/family")
                                      :calendar-id "593557a2-6721-38bf-0243-0cd18c9237ea" ; 家庭日历
                                      :select-tags (list "family")
                                      :files '("~/org/gtd/gtd.org")
                                      :inbox "~/org/inbox/caldav-family.org")))
    :bind
    ("C-c t c" . org-caldav-sync)
    )
#+end_src
** Org Anki
#+begin_src emacs-lisp
  (leaf org-anki
    :straight t
    :ensure-system-package anki
    )
#+end_src
** Toc-Org 自动生成目录
保存时自动更新具有 :TOC: 的标题为目录
#+begin_src emacs-lisp
  (leaf toc-org
    :straight t
    :after org
    :hook
    (org-mode-hook . toc-org-mode)
    )
#+end_src
** cal-x 农历
#+begin_src emacs-lisp
  (leaf cal-china-x
    :straight t
    :custom
    (mark-holidays-in-calendar . t)
    (calendar-holidays . '(
                           (holiday-fixed 1 1 "元旦")
                           (holiday-lunar 1 1 "春节")
                           (holiday-lunar 1 15 "元宵节")
                           (holiday-lunar 2 2 "龙抬头")
                           (holiday-fixed 2 14 "情人节")
                           (holiday-fixed 3 8 "妇女节")
                           (holiday-solar-term "清明" "清明节")
                           (holiday-fixed 5 1 "劳动节")
                           (holiday-lunar 5 5 "端午节")
                           (holiday-lunar 7 7 "七夕")
                           (holiday-lunar 7 15 "中元节")
                           (holiday-lunar 8 15 "中秋节")
                           (holiday-lunar 9 9 "重阳节")
                           (holiday-fixed 10 1 "国庆节")
                           (holiday-lunar 10 1 "寒衣节")
                           (holiday-lunar 12 23 "小年")
                           (holiday-lunar 12 30 "除夕")
                           ))
    ;; 在议程中自定义显示格式为阴历
    (org-agenda-format-date . 'grass-emacs/org-agenda-format-date-aligned)
    )

  ;; agenda中的日期格式化
  (defun grass-emacs/org-agenda-format-date-aligned (date)
    "Format a DATE string for display in the daily/weekly agenda, or timeline.
        This function makes sure that dates are aligned for easy reading."
    (require 'cal-iso)
    (let* ((dayname (aref cal-china-x-days
                          (calendar-day-of-week date)))
           (day (cadr date))
           (month (car date))
           (year (nth 2 date))
           (cn-date (calendar-chinese-from-absolute (calendar-absolute-from-gregorian date)))
           (cn-month (cl-caddr cn-date))
           (cn-day (cl-cadddr cn-date))
           (cn-month-string (concat (aref cal-china-x-month-name
                                          (1- (floor cn-month)))
                                    (if (integerp cn-month)
                                        ""
                                      "(闰月)")))
           (cn-day-string (aref cal-china-x-day-name
                                (1- cn-day))))
      (format "%04d-%02d-%02d 周%s %s%s" year month
              day dayname cn-month-string cn-day-string)))
#+end_src
* 编程语言

** 通用配置

一些不区分语言的功能，例如重命名，简单重构等

*** format 格式化

#+begin_src emacs-lisp
  (leaf format-all
    :straight t
    :commands format-all-mode
    :bind
    ("C-c b =" . format-all-region-or-buffer)
    )
#+end_src

*** editorconfig
#+begin_src emacs-lisp
  (leaf editorconfig
    :straight t
    :global-minor-mode editorconfig-mode
    )
#+end_src

*** COMMENT codeium
使用 =codeium= 可以自动生成代码提示，但是不支持 =TUI=
#+begin_src emacs-lisp
  ;; we recommend using use-package to organize your init.el
  (leaf codeium
    :straight '(codeium :host github :type git :repo "Exafunction/codeium.el")
    ;; if you use straight
    ;; :straight '(:type git :host github :repo "Exafunction/codeium.el")
    ;; otherwise, make sure that the codeium.el file is on load-path

    :init
    ;; use globally
    (add-to-list 'completion-at-point-functions #'codeium-completion-at-point)
    ;; or on a hook
    ;; (add-hook 'python-mode-hook
    ;;     (lambda ()
    ;;         (setq-local completion-at-point-functions '(codeium-completion-at-point))))

    ;; if you want multiple completion backends, use cape (https://github.com/minad/cape):
    ;; (add-hook 'python-mode-hook
    ;;     (lambda ()
    ;;         (setq-local completion-at-point-functions
    ;;             (list (cape-super-capf #'codeium-completion-at-point #'lsp-completion-at-point)))))
    ;; an async company-backend is coming soon!

    ;; codeium-completion-at-point is autoloaded, but you can
    ;; optionally set a timer, which might speed up things as the
    ;; codeium local language server takes ~0.2s to start up
    ;; (add-hook 'emacs-startup-hook
    ;;  (lambda () (run-with-timer 0.1 nil #'codeium-init)))

    ;; :defer t ;; lazy loading, if you want
    :config
    (setq use-dialog-box nil) ;; do not use popup boxes

    ;; if you don't want to use customize to save the api-key
    ;; (setq codeium/metadata/api_key "xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx")

    ;; get codeium status in the modeline
    (setq codeium-mode-line-enable
          (lambda (api) (not (memq api '(CancelRequest Heartbeat AcceptCompletion)))))
    (add-to-list 'mode-line-format '(:eval (car-safe codeium-mode-line)) t)
    ;; alternatively for a more extensive mode-line
    ;; (add-to-list 'mode-line-format '(-50 "" codeium-mode-line) t)

    ;; use M-x codeium-diagnose to see apis/fields that would be sent to the local language server
    (setq codeium-api-enabled
          (lambda (api)
            (memq api '(GetCompletions Heartbeat CancelRequest GetAuthToken RegisterUser auth-redirect AcceptCompletion))))
    ;; you can also set a config for a single buffer like this:
    ;; (add-hook 'python-mode-hook
    ;;     (lambda ()
    ;;         (setq-local codeium/editor_options/tab_size 4)))

    ;; You can overwrite all the codeium configs!
    ;; for example, we recommend limiting the string sent to codeium for better performance
    (defun my-codeium/document/text ()
      (buffer-substring-no-properties (max (- (point) 3000) (point-min)) (min (+ (point) 1000) (point-max))))
    ;; if you change the text, you should also change the cursor_offset
    ;; warning: this is measured by UTF-8 encoded bytes
    (defun my-codeium/document/cursor_offset ()
      (codeium-utf8-byte-length
       (buffer-substring-no-properties (max (- (point) 3000) (point-min)) (point))))
    (setq codeium/document/text 'my-codeium/document/text)
    (setq codeium/document/cursor_offset 'my-codeium/document/cursor_offset))

  (leaf company
    :straight t
    :config
    (global-company-mode t)
    (setq-default
     company-idle-delay 0.05
     company-require-match nil
     company-minimum-prefix-length 0

     ;; get only preview
     company-frontends '(company-preview-frontend)
     ;; also get a drop down
     ;; company-frontends '(company-pseudo-tooltip-frontend company-preview-frontend)
     ))

#+end_src
** Nix
#+begin_src emacs-lisp
  (leaf nix-mode
    :straight t
    :ensure-system-package nixfmt
    :mode "\\.nix\\'"
    ;; :custom
    ;; (lsp-bridge-nix-lsp-server . 'rnix-lsp)
    :setq-default
    (format-all-formatters . '(("Nix" (nixfmt))))
    )
#+end_src
** Sh Script
#+begin_src emacs-lisp
  (leaf sh-script
    :require ob-shell
    )

#+end_src
** PHP

#+begin_src emacs-lisp
  (leaf php-mode
    :straight t
    :ensure-system-package phpactor
    :mode "\\.php\\'"
    :custom
    (lsp-bridge-php-lsp-server . 'phpactor)
    :bind
    (:php-mode-map
     ;; 清除 C-. 为 embark 腾空
     ("C-," . nil)
     ("C-." . nil))
    )
#+end_src

** Python
#+begin_src emacs-lisp
  (leaf python
    :ensure-system-package pyright
    :custom
    (lsp-bridge-python-lsp-server . 'pyright)
    )
#+end_src

** R
#+begin_src emacs-lisp
  (leaf ess
    :straight t
    :ensure-system-package R
    )
#+end_src
** Haskell
#+begin_src emacs-lisp
  (leaf haskell-mode
    :straight t
    :ensure-system-package
    (haskell-language-server-wrapper . haskell-language-server)
    (cabal . cabal-install)
    ghc
    :mode "\\.hs\\'"
    )
#+end_src
