init.el
  (org-caldav-sync-direction . 'twoway)

  (org-caldav-exclude-tags . '("no_caldav"))
  (org-caldav-todo-percent-states  . '(
                                       (0 "TODO")
                                       (10 "NEXT")
                                       (100 "DONE")
                                       ))

  ;; ;; 如果上一次异常，不询问
  (org-caldav-resume-aborted . 'always)

  ;; 同步过程中自动删除条目，不再询问(我的本地org使用了git存储)
  ;; org-caldav-delete-org-entries 'always
  (org-caldav-delete-calendar-entries . 'always)

  ;; 不导出 VTODO
  (org-caldav-sync-todo . t)
  (org-icalendar-include-todo . '("TODO" "NEXT"))

  ;; 如果不是是todo节点，会作为一个event
  (org-icalendar-use-scheduled . '(todo-start event-if-not-todo))

  ;; 如果不是todo节点，会作为一个event
  (org-icalendar-use-deadline . '(todo-due event-if-not-todo))

  ;; 不使用sexp
  (org-icalendar-include-sexps . nil)
  (org-icalendar-include-bbdb-anniversaries . nil)

  ;; 后台导出，不显示同步结果
  (org-caldav-show-sync-results . nil)
  ;; debug logs
  (org-caldav-debug-level . 1)
  :init
  ;; 多个日历
  (setq org-caldav-calendars (list (list
                                    :url (concat "https://grass:" (grass-emacs/get-bitwarden-password "carddav:grass") "@carddav.grass.work:30443/grass")
                                    :calendar-id "34a7e558-4066-efe4-69f7-15ada01bc7b6" ; 个人日历
                                    :select-tags (list "personal" "work")
                                    :files '("~/org/gtd/gtd.org")
                                    :inbox "~/org/inbox/caldav-personal.org")
                                   (list
                                    :url (concat "https://family:" (grass-emacs/get-bitwarden-password "carddav:family") "@carddav.grass.work:30443/family")
                                    :calendar-id "593557a2-6721-38bf-0243-0cd18c9237ea" ; 家庭日历
                                    :select-tags (list "family")
                                    :files '("~/org/gtd/gtd.org")
                                    :inbox "~/org/inbox/caldav-family.org")))
  :bind
  ("C-c t c" . org-caldav-sync)
  )

(leaf org-anki
  :straight t
  :ensure-system-package anki
  )

(leaf toc-org
  :straight t
  :after org
  :hook
  (org-mode-hook . toc-org-mode)
  )

(leaf cal-china-x
  :straight t
  :custom
  (mark-holidays-in-calendar . t)
  (calendar-holidays . '(
                         (holiday-fixed 1 1 "元旦")
                         (holiday-lunar 1 1 "春节")
                         (holiday-lunar 1 15 "元宵节")
                         (holiday-lunar 2 2 "龙抬头")
                         (holiday-fixed 2 14 "情人节")
                         (holiday-fixed 3 8 "妇女节")
                         (holiday-solar-term "清明" "清明节")
                         (holiday-fixed 5 1 "劳动节")
                         (holiday-lunar 5 5 "端午节")
                         (holiday-lunar 7 7 "七夕")
                         (holiday-lunar 7 15 "中元节")
                         (holiday-lunar 8 15 "中秋节")
                         (holiday-lunar 9 9 "重阳节")
                         (holiday-fixed 10 1 "国庆节")
                         (holiday-lunar 10 1 "寒衣节")
                         (holiday-lunar 12 23 "小年")
                         (holiday-lunar 12 30 "除夕")
                         ))
  ;; 在议程中自定义显示格式为阴历
  (org-agenda-format-date . 'grass-emacs/org-agenda-format-date-aligned)
  )

;; agenda中的日期格式化
(defun grass-emacs/org-agenda-format-date-aligned (date)
  "Format a DATE string for display in the daily/weekly agenda, or timeline.
      This function makes sure that dates are aligned for easy reading."
  (require 'cal-iso)
  (let* ((dayname (aref cal-china-x-days
                        (calendar-day-of-week date)))
         (day (cadr date))
         (month (car date))
         (year (nth 2 date))
         (cn-date (calendar-chinese-from-absolute (calendar-absolute-from-gregorian date)))
         (cn-month (cl-caddr cn-date))
         (cn-day (cl-cadddr cn-date))
         (cn-month-string (concat (aref cal-china-x-month-name
                                        (1- (floor cn-month)))
                                  (if (integerp cn-month)
                                      ""
                                    "(闰月)")))
         (cn-day-string (aref cal-china-x-day-name
                              (1- cn-day))))
    (format "%04d-%02d-%02d 周%s %s%s" year month
            day dayname cn-month-string cn-day-string)))

(leaf format-all
  :straight t
  :commands format-all-mode
  :bind
  ("C-c b =" . format-all-region-or-buffer)
  )

(leaf editorconfig
  :straight t
  :global-minor-mode editorconfig-mode
  )

(leaf nix-mode
  :straight t
  :ensure-system-package nixfmt
  :mode "\\.nix\\'"
  ;; :custom
  ;; (lsp-bridge-nix-lsp-server . 'rnix-lsp)
  :setq-default
  (format-all-formatters . '(("Nix" (nixfmt))))
  )

(leaf php-mode
  :straight t
  :ensure-system-package phpactor
  :mode "\\.php\\'"
  :custom
  (lsp-bridge-php-lsp-server . 'phpactor)
  :bind
  (:php-mode-map
   ;; 清除 C-. 为 embark 腾空
   ("C-," . nil)
   ("C-." . nil))
  )

(leaf python
  :ensure-system-package pyright
  :custom
  (lsp-bridge-python-lsp-server . 'pyright)
  )

(leaf ess
  :straight t
  :ensure-system-package R
  )

(leaf haskell-mode
  :straight t
  :ensure-system-package
  (haskell-language-server-wrapper . haskell-language-server)
  (cabal . cabal-install)
  ghc
  :mode "\\.hs\\'"
  )

;; 配置emmet-mode
;; 默认为C-j展开
(leaf emmet-mode
  :straight t
