README.org
** Web

使用 =Emmet= 处理快速展开，语法高亮都使用 =treesite= ， =ts= 和 =js= 的基础补全使用 =lsp= ，其余高级功能使用 =tide=
#+begin_src emacs-lisp
  ;; 配置emmet-mode
  ;; 默认为C-j展开
  (leaf emmet-mode
    :straight t
    :hook html-mode-hook
    :hook html-ts-mode-hook
    :hook css-mode-hook
    :hook vue-mode-hook
    )

  (leaf typescript-ts-mode
    :ensure-system-package
    (typescript-language-server . nodePackages.typescript-language-server)
    (tsc . typescript)
    yaml-language-server
    :mode "\\.ts\\'"
    )

  ;; (leaf tide
  ;;   :straight t
  ;;   :hook
  ;;   (typescript-ts-mode-hook . tide-setup)
  ;;   (tsx-ts-mode-hook . tide-setup)
  ;;   (js-mode-hook . tide-setup)
  ;;   (vue-mode-hook . tide-setup)
  ;;   (typescript-ts-mode-hook . tide-hl-identifier-mode)
  ;;   )
#+end_src

** Vue
#+begin_src emacs-lisp
  (leaf vue-mode
    :straight t
    :ensure-system-package
    emmet-ls
    (vue-language-server . nodePackages.volar)
    (vscode-css-language-server . vscode-langservers-extracted)

    :mode "\\.vue\\'"
    :custom
    ;; 0, 1, or 2, representing (respectively) none, low, and high coloring
    (mmm-submode-decoration-level . 0)
    )
#+end_src

** Markdown

#+begin_src emacs-lisp
  (leaf markdown-mode
    :straight t
    :ensure-system-package multimarkdown
    :mode ("README\\.md\\'" . gfm-mode)
    :custom
    (markdown-command . "multimarkdown")
    :bind
    (:markdown-mode-map
     ("C-c C-e" . markdown-do)
     ))
#+end_src

** YAML

#+begin_src emacs-lisp
  (leaf yaml-ts-mode
    :mode ("\\.yml\\'" "\\.yaml\\'")
    :setq-default
    (format-all-formatters . '(("YAML" (prettier)))))
#+end_src

** Dotenv
#+begin_src emacs-lisp
  (leaf dotenv-mode
    :straight t
    :mode "\\.env\\..*\\'"
    )
#+end_src
** PlantUML

#+begin_src emacs-lisp
  (leaf plantuml-mode
    :straight t
    :ensure-system-package plantuml
    :mode ("\\.puml\\'" "\\.plantuml\\'" "\\.wsd\\'" "\\.pu\\'" "\\.iuml\\'")
    :custom
    (plantuml-default-exec-mode . 'executable)
    (plantuml-executable-args . '(
                                  "-headless"
                                  "-charset"
                                  "UTF-8"
                                  ))
    )
#+end_src

** Mermaid
#+begin_src emacs-lisp
  (leaf mermaid-mode
    :straight t
    :ensure-system-package
    (mmdc . mermaid-cli)
    )
#+end_src
** Just File
#+begin_src emacs-lisp
  (leaf just-mode
    :straight t
    :mode ("\\justfile\\'")
    )
  (leaf justl
    :straight t
    :bind
    ("C-c p r" . justl-exec-recipe-in-dir)
    )
#+end_src

** Docker
#+begin_src emacs-lisp
  (leaf dockerfile-mode
    :straight t
    :mode ("\\Dockerfile\\'")
    )
#+end_src

** TODO-keyword
#+begin_src emacs-lisp
  (leaf hl-todo
    :straight t
    :global-minor-mode global-hl-todo-mode
    )

  (leaf magit-todos
    :straight t
    :after magit
    :global-minor-mode magit-todos-mode
    )

  (leaf consult-todo
    :straight t
    :after consult
    :bind
    ("C-c p t" . consult-todo-project)
    ("C-c j t" . consult-todo)
    )
#+end_src

** Ledger

#+begin_src emacs-lisp
  (leaf ledger-mode
    :straight t
    :ensure-system-package ledger
    :require ob-ledger
    :mode "\\.ledger\\'"
    :custom
    (ledger-post-amount-alignment-column . 60)
    )
#+end_src
* Style
#+begin_src emacs-lisp
  ;; 高亮当前行
  (leaf hl-line
    :global-minor-mode global-hl-line-mode
    )

  (leaf modus-themes
    :straight t
    :leaf-defer nil
    :require t
    :config
    (setq modus-themes-italic-constructs t
          modus-themes-bold-constructs nil)

    (setq modus-themes-to-toggle '(modus-vivendi-tinted modus-operandi-tinted))
    (modus-themes-load-theme 'modus-vivendi-tinted)
    ;; Maybe define some palette overrides, such as by using our presets
    ;; (setq modus-themes-common-palette-overrides
    ;;       modus-themes-preset-overrides-intense)

    :bind
    ("<f5>" . modus-themes-toggle)
    ("C-c t t" . modus-themes-toggle)
    )

  (leaf nerd-icons
    :straight t
    )

  (leaf nerd-icons-dired
    :straight t
    :after nerd-icons
    :hook
    (dired-mode-hook . nerd-icons-dired-mode))
  (leaf nerd-icons-completion
    :straight t
    :after marginalia nerd-icons
    :config
    (nerd-icons-completion-mode)
    (add-hook 'marginalia-mode-hook #'nerd-icons-completion-marginalia-setup))
#+end_src


* 杂项

** Undo/Redo
#+begin_src emacs-lisp
  (leaf vundo
    :straight t
    :bind
    ("C-c u" . vundo)
    )

#+end_src
** 小功能
#+begin_src emacs-lisp


  ;; 当某个文件的某一行特别长的时候，自动优化性能
  (leaf so-long
    :straight t
    :global-minor-mode global-so-long-mode
    )

  ;; 自动给内置函数增加 demo
  (leaf elisp-demos
    :straight t
    :config
    (advice-add 'describe-function-1 :after #'elisp-demos-advice-describe-function-1)
    )
  ;; (leaf company)


  ;; 记录命令使用次数
  (leaf keyfreq
    :straight t
    :config
    (keyfreq-mode 1)
    (keyfreq-autosave-mode 1))

  (leaf wakatime-mode
    :straight t
    :ensure-system-package (wakatime-cli . wakatime)
    :global-minor-mode global-wakatime-mode
    :config
    (setq wakatime-cli-path "wakatime-cli")
    )

  ;; 快速选择工具
  ;; (leaf expand-region
  ;;   :bind
  ;;   ("C-c e" . er/expand-region)
  ;;   )

  ;; A few more useful configurations...


  ;; Optionally use the `orderless' completion style.

  (leaf dirvish
    :straight t
    :config
    (setq dirvish-mode-line-format
          '(:left (sort symlink) :right (omit yank index)))
    (setq dirvish-mode-line-height 10)
    (setq dirvish-attributes
          '(nerd-icons file-time file-size collapse subtree-state vc-state git-msg))
    (setq dirvish-subtree-state-style 'nerd)
    (setq delete-by-moving-to-trash t)
    (setq dirvish-path-separators (list
                                   (format "  %s " (nerd-icons-codicon "nf-cod-home"))
                                   (format "  %s " (nerd-icons-codicon "nf-cod-root_folder"))
                                   (format " %s " (nerd-icons-faicon "nf-fa-angle_right"))))
    (setq dired-listing-switches
          "-l --almost-all --human-readable --group-directories-first --no-group")
    (dirvish-peek-mode) ; Preview files in minibuffer
    (dirvish-side-follow-mode) ; similar to `treemacs-follow-mode'
    :hook
    (dired-mode-hook . (dirvish-override-dired-mode))
    )
#+end_src


